:PROPERTIES:
:ID:       d873c066-f8db-49f1-aacc-070c4a1099e7
:END:
#+TITLE: ecosyste.ms
#+DESCRIPTION: 
#+TAGS:

* Roam
+ [[id:8d789c98-5e74-4bf8-9226-52fb43c5ca51][Gitforge]]
+ [[id:f6350f65-05c7-4a87-bfd1-0a7962e30190][Linux: Repology]]
+ [[id:8fb0a586-9c0f-4f36-b1ab-dc5c26681d15][OSS: Open Source]]
+ [[id:a7cc960b-4174-4029-bf38-9966894eeeee][OpenAPI]]

* Docs
** APIs

|                            | Name                | Docs   | Category     |
|----------------------------+---------------------+--------+--------------|
| [[https://packages.ecosyste.ms/][packages.ecosyste.ms]]       | Packages            | [[https://packages.ecosyste.ms/docs/index.html][schema]] | Data         |
| [[https://repos.ecosyste.ms/][repos.ecosyste.ms]]          | Repositories        | [[https://repos.ecosyste.ms/docs/index.html][schema]] | Data         |
| [[https://advisories.ecosyste.ms/][advisories.ecosyste.ms]]     | Advisories          | [[https://advisories.ecosyste.ms/docs/index.html][schema]] | Data         |
|----------------------------+---------------------+--------+--------------|
| [[https://parser.ecosyste.ms/][parser.ecosyste.ms]]         | Dependency Parser   | [[https://parser.ecosyste.ms/docs/index.html][schema]] | Tools        |
| [[https://resolve.ecosyste.ms/][resolve.ecosyste.ms]]        | Dependency Resolver | [[https://resolve.ecosyste.ms/docs/index.html][schema]] | Tools        |
| [[https://sbom.ecosyste.ms/][sbom.ecosyste.ms]]           | SBOM Parser         | [[https://sbom.ecosyste.ms/docs/index.html][schema]] | Tools        |
| [[https://licenses.ecosyste.ms/][licenses.ecosyste.ms]]       | License Parser      | [[https://licenses.ecosyste.ms/docs/index.html][schema]] | Tools        |
| [[https://digest.ecosyste.ms/][digest.ecosyste.ms]]         | Digest              | [[https://digest.ecosyste.ms/docs/index.html][schema]] | Tools        |
| [[https://archives.ecosyste.ms/][archives.ecosyste.ms]]       | Archives            | [[https://archives.ecosyste.ms/docs/index.html][schema]] | Tools        |
| [[https://diff.ecosyste.ms/][diff.ecosyste.ms]]           | Diff                | [[https://diff.ecosyste.ms/docs/index.html][schema]] | Tools        |
| [[https://summary.ecosyste.ms/][summary.ecosyste.ms]]        | Summary             | [[https://summary.ecosyste.ms/docs/index.html][schema]] | Tools        |
|----------------------------+---------------------+--------+--------------|
| [[https://timeline.ecosyste.ms/][timeline.ecosyste.ms]]       | Timeline            | [[https://timeline.ecosyste.ms/docs/index.html][schema]] | Indexes      |
| [[https://commits.ecosyste.ms/][commits.ecosyste.ms]]        | Commits             | [[https://commits.ecosyste.ms/docs/index.html][schema]] | Indexes      |
| [[https://issues.ecosyste.ms/][issues.ecosyste.ms]]         | Issues              | [[https://issues.ecosyste.ms/docs/index.html][schema]] | Indexes      |
| [[https://sponsors.ecosyste.ms/][sponsors.ecosyste.ms]]       | Sponsors            | [[https://sponsors.ecosyste.ms/docs/index.html][schema]] | Indexes      |
| [[https://docker.ecosyste.ms/][docker.ecosyste.ms]]         | Docker              | [[https://docker.ecosyste.ms/docs/index.html][schema]] | Indexes      |
| [[https://opencollective.ecosyste.ms/][opencollective.ecosyste.ms]] | Open Collective     | [[https://opencollective.ecosyste.ms/docs/index.html][schema]] | Indexes      |
| [[https://dependabot.ecosyste.ms/][dependabot.ecosyste.ms]]     | Dependabot          | [[https://dependabot.ecosyste.ms/docs/index.html][schema]] | Indexes      |
|----------------------------+---------------------+--------+--------------|
| [[https://funds.ecosyste.ms/][funds.ecosyste.ms]]          | Funds               | [[https://funds.ecosyste.ms/docs/index.html][schema]] | Applications |
| [[https://dashboards.ecosyste.ms/][dashboards.ecosyste.ms]]     | Dashboards          | [[https://dashboards.ecosyste.ms/docs/index.html][schema]] | Applications |
|----------------------------+---------------------+--------+--------------|
| [[https://ost.ecosyste.ms/][ost.ecosyste.ms]]            | OST                 | [[https://ost.ecosyste.ms/docs/index.html][schema]] | Experiments  |
| [[https://papers.ecosyste.ms/][papers.ecosyste.ms]]         | Papers              | [[https://papers.ecosyste.ms/docs/index.html][schema]] | Experiments  |
| [[https://awesome.ecosyste.ms/][awesome.ecosyste.ms]]        | Awesome             | [[https://awesome.ecosyste.ms/docs/index.html][schema]] | Experiments  |
| [[https://ruby.ecosyste.ms/][ruby.ecosyste.ms]]           | Ruby                | [[https://ruby.ecosyste.ms/docs/index.html][schema]] | Experiments  |
** Tools

+ [[https://github.com/ecosyste-ms/mcp][ecosyste.ms/mcp]] :: MCP that queries sqlite bundled with [[https://github.com/ecosyste-ms/critical][ecosyste.ms/critical]]
  - sqlite released daily in [[https://github.com/ecosyste-ms/critical/releases/tag/v1.1.20260531][critical releases]]

** Publications

+ [[https://arxiv.org/abs/2605.06164v2][{2605.06164v2} Modeling Dependency-Propagated Ecosystem Impact of Changes in ...]]

* Resources
* Topics
** Schemata
*** OpenAPI

This is handy

#+begin_src shell
wc -l $(locate '/data/ecto/metaforge/*openapi*.yaml') | sort -k2
#+end_src

#+RESULTS:
|   348 | /data/ecto/metaforge/ecosyste-ms/advisories/openapi/api/v1/openapi.yaml                          |
|   404 | /data/ecto/metaforge/ecosyste-ms/advisories/openapi/osv/v1/openapi.yaml                          |
|   178 | /data/ecto/metaforge/ecosyste-ms/archives/openapi/api/v1/openapi.yaml                            |
|   522 | /data/ecto/metaforge/ecosyste-ms/awesome/openapi/api/v1/openapi.yaml                             |
|   390 | /data/ecto/metaforge/ecosyste-ms/commits/openapi/api/v1/openapi.yaml                             |
|   863 | /data/ecto/metaforge/ecosyste-ms/dashboards/openapi/api/v1/openapi.yaml                          |
|   869 | /data/ecto/metaforge/ecosyste-ms/dependabot/openapi/api/v1/openapi.yaml                          |
|    87 | /data/ecto/metaforge/ecosyste-ms/diff/openapi/api/v1/openapi.yaml                                |
|    99 | /data/ecto/metaforge/ecosyste-ms/digest/public/openapi.yaml                                      |
|   532 | /data/ecto/metaforge/ecosyste-ms/docker/openapi/api/v1/openapi.yaml                              |
|   311 | /data/ecto/metaforge/ecosyste-ms/dotfiles/openapi/api/v1/openapi.yaml                            |
|   347 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/advisories.openapi.yaml     |
|   193 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/archives.openapi.yaml       |
|   391 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/commits.openapi.yaml        |
|   887 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/dependabot.openapi.yaml     |
|    90 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/diff.openapi.yaml           |
|   534 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/docker.openapi.yaml         |
|   839 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/issues.openapi.yaml         |
|    80 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/licenses.openapi.yaml       |
|   247 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/opencollective.openapi.yaml |
|  2522 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/packages.openapi.yaml       |
|    97 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/parser.openapi.yaml         |
|  1521 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/repos.openapi.yaml          |
|   130 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/resolve.openapi.yaml        |
|    79 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/sbom.openapi.yaml           |
|   283 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/sponsors.openapi.yaml       |
|   239 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/summary.openapi.yaml        |
|    91 | /data/ecto/metaforge/ecosyste-ms/ecosyste_ms_cli/ecosystems_cli/apis/timeline.openapi.yaml       |
|   838 | /data/ecto/metaforge/ecosyste-ms/issues/openapi/api/v1/openapi.yaml                              |
|    77 | /data/ecto/metaforge/ecosyste-ms/licenses/openapi/api/v1/openapi.yaml                            |
|   245 | /data/ecto/metaforge/ecosyste-ms/opencollective/openapi/api/v1/openapi.yaml                      |
|   399 | /data/ecto/metaforge/ecosyste-ms/ost/openapi/api/v1/openapi.yaml                                 |
|  6088 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/artifacthub.yaml        |
|   185 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/clojars.yaml            |
|   139 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/cocoapods.yaml          |
|   116 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/conda.yaml              |
|   272 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/cpan.yaml               |
|   126 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/deno.yaml               |
|   135 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/docker.yaml             |
|   152 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/drupal.yaml             |
|   138 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/elm.yaml                |
|   297 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/go.yaml                 |
|   537 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/hex.yaml                |
|   219 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/homebrew.yaml           |
|   565 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/maven.yaml              |
|   534 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/npm.yaml                |
|   745 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/nuget.yaml              |
|   529 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/packagist.yaml          |
|   477 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/pub.yaml                |
|   155 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/puppet.yaml             |
|   555 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/pypi.yaml               |
|   480 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/rubygems.yaml           |
|   212 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/terraform.yaml          |
|   200 | /data/ecto/metaforge/ecosyste-ms/package-manager-openapi-schemas/openapi/wordpress.yaml          |
|  2552 | /data/ecto/metaforge/ecosyste-ms/packages/openapi/api/v1/openapi.yaml                            |
|   340 | /data/ecto/metaforge/ecosyste-ms/papers/openapi/api/v1/openapi.yaml                              |
|    94 | /data/ecto/metaforge/ecosyste-ms/parser/openapi/api/v1/openapi.yaml                              |
|  1501 | /data/ecto/metaforge/ecosyste-ms/repos/openapi/api/v1/openapi.yaml                               |
|   132 | /data/ecto/metaforge/ecosyste-ms/resolve/openapi/api/v1/openapi.yaml                             |
|   311 | /data/ecto/metaforge/ecosyste-ms/ruby/openapi/api/v1/openapi.yaml                                |
|    77 | /data/ecto/metaforge/ecosyste-ms/sbom/openapi/api/v1/openapi.yaml                                |
|   373 | /data/ecto/metaforge/ecosyste-ms/science/openapi/api/v1/openapi.yaml                             |
|   284 | /data/ecto/metaforge/ecosyste-ms/sponsors/openapi/api/v1/openapi.yaml                            |
|   236 | /data/ecto/metaforge/ecosyste-ms/summary/openapi/api/v1/openapi.yaml                             |
|    89 | /data/ecto/metaforge/ecosyste-ms/timeline/openapi/api/v1/openapi.yaml                            |
| 33577 | total                                                                                            |

